[
    {
        "title": "Betty Bot #Python",
        "description1": "Betty Bot is an Open Source arbitrage betting bot. It was developed in Python using Selenium to scrape the data from the betting platforms and we were using a mathematical formula to calculate the outcome.",
        "description2": "There was no GUI designed for the application. It was working good overall but we had to stop it due to the lack of money and pacience that we didn't have at that time. Hope we'll get back to it !"
    },
    {
        "title": "MovieFindr #Python and Typescript",
        "description1": "MovieFindr is a school project that I've build over the course of a semester. It was a Full-Stack web app. The backend was developed in Python using Django and using a PostgreSQL database. The frontend was developed in Typescript using React + Vite. It was also deployed during development on AWS, but it is not available anymore.",
        "description2": "It was designed as a place where users could join and search for different movies based on their rating, favorite actors or productions. It is by far the most complex project that I've worked on and I'm really proud of it. It has a custom authentication system, a custom admin panel and a lot of other features."
    },
    {
        "title": "Tutorial Manager #C++",
        "description1": "Tutorial Manager is a school project that I've build over the course of a semester. It was a CLI app. The backend was developed in C++ using a custom data structure that I've designed. ",
        "description2": "It had a custom authentication system and a custom admin panel and it was a good starting point in my development path."
    },
    {
        "title": "Custom Data Structures #C++",
        "description1": "Designed various custom data structures in C++ such as: Sorted Set/Bag/Map on a random given relation or Single Linked List both over a dynamic array and a simple array.",
        "description2": "Some tests were also written for them, both simple (few hundreds of operations) and complex (thousands of operations)."
    },
    {
        "title": "Building, Flashing and Testing Android AOSP #Linux and Android",
        "description1": "In the first part of my internship program, I was mainly working with the AOSP (Android Open Source Project). For this, I had to setup a Raspberry Pi 4 to be able to simulate the Android Auto experience from a real car. After that I had to flash an AAOS distribution on the same board.",
        "description2": "Being successful in the previous phase, a new automotive-specific development board was given to me. I had to flash the same AAOS distribution on it and to test it, to make sure that it is working as expected. I also had to work with ADB to check different conneections (camera or USB connections) and to test some custom application in terms of resource consumption."
    },
    {
        "title": "Android Demo App #Dart and Flutter",
        "description1": "Together with some of my colleagues we have build a demo application for the Android Auto platform. It was a simple app that we had to start with. We implemented a simple UI with a few pages accessible from a side menu.",
        "description2": "Some of the features that the app had were: home page with current time, weather and location, network speed test, task manager, camera streaming and recording, etc."
    },
    {
        "title": "Remote Car Controlling App #Dart and Flutter",
        "description1": "After getting used to working with Flutter SDK and Dart, we were given the task of creating a mock mobile application which would be used to control a remote car. The API for controlling the car has not been developed, so we only had a working UI prototype of the app.",
        "description2": "It was meant to let the user control the horn or lights of the car, locl/unlock the car, modify the internal temperature, etc. It was a good experience for me to implement a given design and to improve my teamwork skills."
    },
    {
        "title": "Maintaining MOM Tool #Python and Qt",
        "description1": "This project was the main focus of my internship program. I had to maintain and improve an internal tool used by the company that hired us. The tool has been developed in Python using the Qt framework before I joined the team, so I had to get used to the codebase, being able to understand it and to improve it later on.",
        "description2": "In this project, different skills have been improved, such as: teamwork, communication, problem solving, working under time pressure and the ability to deliver a product in a short amount of time. Besides maintaining the tool, I also had to maintain some internal documentation and Jira tickets."
    }
]